// Все стірлочними!!!!!!!!!
//     - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.

/*let masuv = [5,10,8,22];

let sereduna = (masuv) => {
    let res = 0;
    for (const item of masuv) {
        res += item;
    }
    return res/masuv.length;
}
console.log(sereduna(masuv));*/

// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
// (Math використовувати заборонено);

/*
let xxx = (...arg) => {
    let min = arg[0];
    let max = arg[0];
    for (const argElement of arg) {
        if(argElement < min) {
            min = argElement;
        }
        if(argElement > max) {
            max = argElement;
        }
        
    }
    console.log(max);
    return min;
}

console.log(xxx (2,5,7,9,10));
*/


// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.

/*let random = () => {
    let arr = [];
    for (let i = 0; i < 10; i++) {
        arr.push(Math.round(Math.random()*100));
    }
    return arr;
}

console.log(random());*/


// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.

/*let random = (limit) => {
    let arr = [];
    for (let i = 0; i < limit; i++) {
        // arr.push(Math.round(Math.random()*100));
        arr[i] = Math.round(Math.random()*100);
    }
    return arr;
}

console.log(random(5));*/

// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].

/*let mas = [1, 2, 3];
let fff = (array) => {
    let newarr = [];
    // for (let i = array.length - 1, j = 0; i >= 0; i--, j++) {
    //     newarr[j] = array[i];
    for (let i = array.length - 1; i >= 0; i--) {
        newarr.push(array[i]);
    }
    return newarr;
}

console.log(fff(mas));*/
// -створити функцію, яка приймає масив з 2х об'єктів, та міняє їх місцями.

/*let arr = [
    {
        age: 22
    },
    {
        age: 33
    }
];
let change = (array) => {
    let temp = array[0];
    array[0] = array[1];
    array[1] = temp;
    return array;
}

console.log(change(arr));*/

//     Переробити на стрілочні функції з попереднього дз
// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
/*let pr = (a,b) => a*b;
console.log(pr(2,3));*/
// - створити функцію яка обчислює та повертає площу кола з радіусом r
let kl = (r) => 3,14 * r * r; 
console.log(kl(3));
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
//
// -створити функцію, яка приймає масив з 2х об'єктів, та міняє їх місцями.